<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0c7c817bd04d1e3226dfec8d70d3a4b6c3873d9407fa4622fc5a355017d3c095","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1029 at https://github.com/cal-itp/data-infra/actions/runs/19484307853","plan_out_hash":"8cc0fbce59aab56e8f2951253edd94a740da34139e9ec8774a7abcde562e9364","plan_hash":"17e215cac525088008709166736ff3dab166fe6698f24fa17122e22d55431232","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "7R0qvg==" -> (known after apply)
!~      detect_md5hash      = "/P4pTzUjCTXoT+c57FGYfQ==" -> "different hash"
!~      generation          = 1763432903372455 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "/P4pTzUjCTXoT+c57FGYfQ==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "oD5g+w==" -> (known after apply)
!~      detect_md5hash      = "Rslo4Ecr3eGFAzYtFuerhw==" -> "different hash"
!~      generation          = 1763431106120040 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "Rslo4Ecr3eGFAzYtFuerhw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "AmoX1g==" -> (known after apply)
!~      detect_md5hash      = "32e2YxZ8YVVpaVcbMfrV+w==" -> "different hash"
!~      generation          = 1762459059031940 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "32e2YxZ8YVVpaVcbMfrV+w==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "fu7W5Q==" -> (known after apply)
!~      detect_md5hash      = "kq/mXkvsle3Doty4QFY6Rw==" -> "different hash"
!~      generation          = 1763431107846926 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "kq/mXkvsle3Doty4QFY6Rw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1029](https://github.com/cal-itp/data-infra/actions/runs/19484307853)